Repository: FelipePSoares/EconoFlow
Catalog: EasyFinance.Infrastructure/ValidationMessages.*.resx
Languages: pt

# GoalDefinedCantBeLessThanExpensesGoal
source: Goal defined to category ({0}) can't be less than the sum of the expenses goal ({1})
pt: Meta definida para a categoria ({0}) não pode ser menor que a soma da meta de despesas ({1})

source: Invalid date
pt: Data inválida

# PropertyCantBeLessOrEqualThanZero
source: {0} can't be less or equal than zero
pt: {0} não pode ser menor ou igual a zero.

# PropertyCantBeLessThanZero
source: {0} can't be less than zero
pt: {0} não pode ser menor que zero.

# PropertyCantBeNull
source: {0} can't be null
pt: {0} não pode ser nulo.

# PropertyCantBeNullOrEmpty
source: {0} can't be null or empty
pt: {0} não pode ser nulo ou vazio.

# CantAddExpenseOlderThanYears
source: You can't add expense older than {0} years
pt: Você não pode adicionar despesa mais antiga que {0} anos

source: Can't import budget because already exists
pt: Não é possível importar o orçamento porque já existe.

# CantAddExpenseItemWithDifferentYearOrMonthFromExpense
source: Can't add an expense item with different year or month from expense
pt: Não é possível adicionar um item de despesa com ano ou mês diferente da despesa.

source: Invalid currency code
pt: Código de moeda inválido

# WarningMessageToUserWhoWantsToDeleteAccount
source: This action is permanent and cannot be undone. Are you sure you want to delete your account?
pt: Esta ação é permanente e não pode ser desfeita. Tem certeza de que deseja excluir sua conta?

# WarningMessageToAdminUserWhoWantsToDeleteAccount
source: <p>This action is permanent and cannot be undone. Are you sure you want to delete your account?</p><p><span style="color: #ff0000;">You are associated as a sole administrator of the projects below:</span></p><ul>{0}</ul><p>Please transfer the administration to another user before deleting your account. Otherwise, the project(s) will be deleted also.</p>
pt: <p>Esta ação é permanente e não pode ser desfeita. Tem certeza de que deseja excluir sua conta?</p><p><span class="danger" >Você está associado como administrador único dos projetos abaixo:</span></p><ul>{0}</ul><p>Por favor, transfira a administração para outro usuário antes de excluir sua conta. Caso contrário, o(s) projeto(s) também será(ão) excluído(s).</p>

# InvalidDeleteToken
source: Delete token expired, please start the delete process again.
pt: Token de exclusão expirado, por favor inicie o processo de exclusão novamente. Categoria não encontrada.

# EitherUserOrEmailMustBeProvided
source: Either a User or an Email must be provided.
pt: Um Usuário ou um E-mail deve ser fornecido.

source: Can't accept expired invitation
pt: Não é possível aceitar convite expirado.

source: Invalid date range.
pt: Intervalo de data inválido.

# InvalidExpenseId
source: ExpenseId is not valid.
pt: Id de Despesa inválido.

# InvalidExpenseItemId
source: ExpenseItemId is not valid.
pt: Id de Item de Despesa inválido.

source: Invalid CategoryId.
pt: Id de Categoria inválido.

# InvalidIncomeId
source: IncomeId is not valid.
pt: Id de Receita inválido.

# InvalidProjectId
source: ProjectId is not valid.
pt: Id do Projeto inválido.

# AdminRequired
source: At least one admin is required in the project.
pt: Pelo menos um administrador é necessário no projeto..

# OldPasswordRequired
source: The old password is required to set a new password. If the old password is forgotten, use forget my password.
pt: A senha antiga é necessária para definir uma nova senha. Se a senha antiga for esquecida, use "Esqueci minha senha".

# DuplicateUser
source: User already exists in the project.
pt: Usuário já existe no projeto.

source: Invalid UserProjectId.
pt: ID de Usuário-Projeto inválido.

# FixedExpenses
source: Fixed Costs
pt: Custos fixos

source: Comfort
pt: Conforto

# Pleasures
source: Enjoyment
pt: Prazeres

# YourFuture
source: Financial Freedom
pt: Liberdade financeira

source: Self-Improvement
pt: Conhecimento

# ThankYouConfirmEmailRedirect
source: Thank you for confirming your email. You will be redirect in 5 seconds ...
pt: Obrigado por confirmar seu e-mail. Você será redirecionado em 5 segundos...

# InvalidData
source: Invalid data provided for this operation.
pt: Dados inválidos fornecidos para esta operação.

# YouDontHavePermission
source: You do not have permission to access this resource.
pt: Você não tem permissão para acessar este recurso.

# ResourceNotFound
source: The requested resource was not found.
pt: O recurso solicitado não foi encontrado.

# GenericError
source: An error occurred while processing your request.
pt: Ocorreu um erro ao processar sua solicitação.

source: Invite not found.
pt: Convite não encontrado.

source: Category not found.
pt: Categoria não encontrada.

source: Expense not found.
pt: Despesa não encontrada.

source: Income not found.
pt: Renda não encontrada.

source: Project not found.
pt: Projeto não encontrado.

source: Project not found or insufficient user permissions.
pt: Projeto não encontrado ou permissões de usuário insuficientes.

# SmartSetupNotAvailable
source: You cannot use smart configuration on projects already in use.
pt: Não é possível usar a configuração inteligente em projetos já em uso.

source: Housing
pt: Moradia

source: Basic Utilities
pt: Contas básicas

source: Transportation
pt: Transporte

source: Healthcare
pt: Saúde

source: Extra Food
pt: Alimentação extra

source: Home Improvements
pt: Melhorias na casa

source: Subscriptions & Services
pt: Assinaturas e Serviços

source: Other Personal Comforts
pt: Outros confortos pessoais

source: Travel & Trips
pt: Viagens e Passeios

source: Entertainment
pt: Entretenimento

source: Going Out with Friends & Family
pt: Saídas com amigos e família

source: Investments
pt: Investimentos

source: Emergency Fund
pt: Reserva de emergência

source: Retirement Savings
pt: Previdência privada/Aposentadoria

source: Big Projects
pt: Grandes projetos

source: Education
pt: Educação

source: Mental & Physical Health
pt: Saúde mental e física

source: Example Expense
pt: Despesa de exemplo
